RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_ef_ctrl.c
    EF_CTRL_LOAD_BEFORE_READ_R1;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_EF_KEY_SLOT_10_W3);
    trim->trimLdo18flashVoutAon = (tmpVal >> 26) & 0x0f;
    trim->trimLdo18flashVoutAonParity = (tmpVal >> 30) & 0x01;
    trim->trimLdo18flashVoutAonEn = (tmpVal >> 31) & 0x01;
}
#endif

/****************************************************************************/ /**
 * @brief  Efuse read USB20RCAL trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_USB20RCAL_Trim(Efuse_Ana_USB20RCAL_Trim_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    EF_CTRL_LOAD_BEFORE_READ_R1;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_EF_DAT_1_RSVD_2);
    trim->trimUsb20rcalAon = (tmpVal >> 8) & 0x3f;
    trim->trimUsb20rcalAonParity = (tmpVal >> 14) & 0x01;
    trim->trimUsb20rcalAonEn = (tmpVal >> 15) & 0x01;
}
#endif

/****************************************************************************/ /**
 * @brief  Efuse read RC32M trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32M_Trim(Efuse_Ana_RC32M_Trim_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    EF_CTRL_LOAD_BEFORE_READ_R0;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
    trim->trimRc32mCodeFrExt = (tmpVal >> 4) & 0xff;
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_11_W3);
    trim->trimRc32mCodeFrExtParity = (tmpVal >> 0) & 0x01;
    trim->trimRc32mExtCodeEn = (tmpVal >> 1) & 0x01;
}
#endif

/****************************************************************************/ /**
 * @brief  Efuse read RC32K trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32K_Trim(Efuse_Ana_RC32K_Trim_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_1();

    EF_CTRL_LOAD_BEFORE_READ_R1;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_EF_KEY_SLOT_10_W3);
    trim->trimRc32kCodeFrExt = (tmpVal >> 8) & 0x3ff;
    trim->trimRc32kCodeFrExtParity = (tmpVal >> 18) & 0x01;
    trim->trimRc32kExtCodeEn = (tmpVal >> 19) & 0x01;
}
#endif

/****************************************************************************/ /**
 * @brief
 *
 * @param
 *
 * @return
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_LDO18IO_Vout_Trim(Efuse_Ana_LDO18IO_VOUT_Trim_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    EF_CTRL_LOAD_BEFORE_READ_R0;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_11_W3);
    trim->trimLdo18ioVoutVal = (tmpVal >> 14) & 0x0f;
    trim->trimLdo18ioVoutParity = (tmpVal >> 18) & 0x01;
    trim->trimLdo18ioVoutEn = (tmpVal >> 19) & 0x01;
}
#endif

/****************************************************************************/ /**
 * @brief  Efuse read TSEN trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
*******************************************************************************/
void ATTR_CLOCK_SECTION EF_Ctrl_Read_TSEN_Trim(Efuse_TSEN_Refcode_Corner_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_1();

    EF_CTRL_LOAD_BEFORE_READ_R1;

    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_EF_DAT_1_RSVD_0);
    trim->tsenRefcodeCorner = (tmpVal >> 0) & 0xfff;
    trim->tsenRefcodeCornerParity = (tmpVal >> 12) & 0x01;
    trim->tsenRefcodeCornerEn = (tmpVal >> 13) & 0x01;
}

/****************************************************************************/ /**
 * @brief  Efuse read ADC Gain trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
*******************************************************************************/
void ATTR_CLOCK_SECTION EF_Ctrl_Read_ADC_Gain_Trim(Efuse_ADC_Gain_Coeff_Type *trim)
{
    uint32_t tmpVal = 0;
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_1();

    EF_CTRL_LOAD_BEFORE_READ_R1;

    tmpVal = BL_RD_REG(EF_DATA_BASE,EF_DATA_1_EF_DAT_1_RSVD_0);
    trim->adcGainCoeff = (tmpVal >> 14) & 0xfff;
    trim->adcGainCoeffParity = (tmpVal >> 26) & 0x01;
    trim->adcGainCoeffEn = (tmpVal >> 27) & 0x01;
}

/****************************************************************************/ /**
 * @brief  Efuse write software usage
 *
 * @param  index: index of software usage
 * @param  usage: usage value
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Write_Sw_Usage(uint32_t index, uint32_t usage, uint8_t program)
{
    /* switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    switch (index) {
        case 0:
            BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_0, usage);
            break;

        case 1:
            BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_1, usage);
            break;

        case 2:
            BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_2, usage);
            break;

        case 3:
            BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_3, usage);
            break;

        case 4:
            BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_11_W0, usage);
            break;

        default:
            break;
    }

    if (program) {
        EF_Ctrl_Program_Efuse_0();
    }
}

/****************************************************************************/ /**
 * @brief  Efuse read software usage
 *
 * @param  index: index of software usage
 * @param  usage: usage value
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_Sw_Usage(uint32_t index, uint32_t *usage)
{
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    EF_CTRL_LOAD_BEFORE_READ_R0;

    switch (index) {
        case 0:
            *usage = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_0);
            break;

        case 1:
            *usage = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_1);
            break;

