RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_ef_ctrl.c
        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        /* Every key is 4 words len*/
        ARCH_MemCpy4(pAESKeyStart1 + index * 4, keyData, len);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}

/****************************************************************************/ /**
 * @brief  Efuse read AES key from specified region and index
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  keyData: key data buffer
 * @param  len: key data length in words
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_AES_Key(uint8_t index, uint32_t *keyData, uint32_t len)
{
    uint32_t *pAESKeyStart0 = (uint32_t *)(EF_DATA_BASE + 0x1C);
    uint32_t *pAESKeyStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);

    if ((index <= 3) || (index == 11)) {
        /* Trigger read data from efuse*/
        EF_CTRL_LOAD_BEFORE_READ_R0;

        index = ((index == 11) ? 5 : index);

        /* Every key is 4 words len*/
        ARCH_MemCpy4(keyData, pAESKeyStart0 + index * 4, len);
    } else if ((index < 11) && (index > 3)) {
        /* Trigger read data from efuse*/
        EF_CTRL_LOAD_BEFORE_READ_R1;
        index = index - 4;
        /* Every key is 4 words len*/
        ARCH_MemCpy4(keyData, pAESKeyStart1 + index * 4, len);
    }
}

/****************************************************************************/ /**
 * @brief  Efuse lock writing for aes key
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Writelock_AES_Key(uint8_t index, uint8_t program)
{
    uint32_t tmpVal;

    if ((index <= 3) || (index == 11)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        index = ((index == 11) ? 8 : index);

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
        tmpVal |= (1 << (index + 17));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_LOCK);
        tmpVal |= (1 << (index + 15));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_1_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}

/****************************************************************************/ /**
 * @brief  Efuse lock reading for aes key
 *
 * @param  keyRegion: efuse key region
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Readlock_AES_Key(uint8_t index, uint8_t program)
{
    uint32_t tmpVal;

    if ((index <= 3) || (index == 11)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_0();

        index = ((index == 11) ? 4 : index);

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
        tmpVal |= (1 << (index + 27));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_0();
        }
    } else if ((index < 11) && (index > 3)) {
        /* Switch to AHB clock */
        EF_Ctrl_Sw_AHB_Clk_1();

        index = index - 4;

        tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_1_LOCK);
        tmpVal |= (1 << (index + 25));
        BL_WR_REG(EF_DATA_BASE, EF_DATA_1_LOCK, tmpVal);

        if (program) {
            EF_Ctrl_Program_Efuse_1();
        }
    }
}

/****************************************************************************/ /**
 * @brief  Program data to efuse region 0
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Program_Direct_R0(uint32_t index, uint32_t *data, uint32_t len)
{
    uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);

    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    /* Add delay for CLK to be stable */
    arch_delay_us(4);

    if (data != NULL) {
        ARCH_MemCpy4(pEfuseStart0 + index, data, len);
    }

    EF_Ctrl_Program_Efuse_0();
}

/****************************************************************************/ /**
 * @brief  Program data to efuse region 1
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Program_Direct_R1(uint32_t index, uint32_t *data, uint32_t len)
{
    uint32_t *pEfuseStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);

    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_1();

    /* Add delay for CLK to be stable */
    arch_delay_us(4);

    if (data != NULL) {
        ARCH_MemCpy4(pEfuseStart1 + index, data, len);
    }

    EF_Ctrl_Program_Efuse_1();
}

/****************************************************************************/ /**
 * @brief  Read data from efuse region 0
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_Direct_R0(uint32_t index, uint32_t *data, uint32_t len)
{
    uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);

    EF_CTRL_LOAD_BEFORE_READ_R0;

    ARCH_MemCpy4(data, pEfuseStart0 + index, len);
}

/****************************************************************************/ /**
 * @brief  Read data from efuse region 1
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
*******************************************************************************/
void EF_Ctrl_Read_Direct_R1(uint32_t index, uint32_t *data, uint32_t len)
{
    uint32_t *pEfuseStart1 = (uint32_t *)(EF_DATA_BASE + 0x80);

